<?php
session_start();
?>

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="css/header.css">
    <link rel="stylesheet" href="css/footer.css">
    <link rel="stylesheet" href="css/profile.css">
    <title>My site</title>
</head>

<body>
    <?php include 'header.php' ?>
    <nav class="nav" style="display: flex; justify-content: center">
    <section class="section__profile">
        <div class="info">
            <?php if ($_SESSION['user']['avatar']): ?>
                <div class="avatar"><img src="<?php $_SESSION['user']['avatar'] ?>" alt="avatar"></div>
            <?php else: ?>
                <div class="avatar"><img src="img/user_default.svg" alt="avatar"></div>
            <?php endif; ?>
            <div class="info__text">
                <h3>На сайте с 02.05.2024</h3>
                <h1>Константин Константинопольски</h1>
                <p>Россия, Старокозьмодемьяновское</p>
                <div class="contact">
                    <a href="tel: +79002342387" class="phone">+7 900 234-23-87</a>
                    <div class="icon">
                        <a href="#"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 40 40">
                                <g id="Group_1178" data-name="Group 1178" transform="translate(-551 -948)">
                                    <rect id="Rectangle_2" data-name="Rectangle 2" width="40" height="40" rx="8"
                                        transform="translate(551 948)" fill="transparent" />
                                    <g id="Group_684" data-name="Group 684" transform="translate(561.601 958)">
                                        <path id="Path_275" data-name="Path 275"
                                            d="M50.635,36a10.047,10.047,0,0,0-16.1,11.623L33.473,52.8a.383.383,0,0,0,.061.3.388.388,0,0,0,.412.16l5.072-1.2A10.045,10.045,0,0,0,50.635,36ZM49.053,48.625A7.869,7.869,0,0,1,39.991,50.1l-.707-.35-3.11.736.009-.039.644-3.13-.346-.683A7.866,7.866,0,0,1,49.053,37.5a.419.419,0,0,0,.04.041A7.865,7.865,0,0,1,49.053,48.625Z"
                                            transform="translate(-33.447 -33.024)" fill="#3881e0" />
                                        <path id="Path_276" data-name="Path 276"
                                            d="M70.86,69.366a3.267,3.267,0,0,1-1.74,1.517c-1.326.32-3.36.011-5.892-2.349l-.031-.028c-2.226-2.064-2.8-3.782-2.664-5.144a3.256,3.256,0,0,1,1.265-1.93.724.724,0,0,1,1.132.26l.819,1.841a.72.72,0,0,1-.09.736l-.414.538a.713.713,0,0,0-.064.8,7.74,7.74,0,0,0,1.4,1.559,8.2,8.2,0,0,0,1.946,1.394.7.7,0,0,0,.771-.162l.481-.484a.736.736,0,0,1,.718-.184l1.946.552a.736.736,0,0,1,.412,1.088Z"
                                            transform="translate(-55.53 -56.061)" fill="#3881e0" />
                                    </g>
                                </g>
                            </svg></a>
                        <a href="#"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 40 40">
                                <g id="Group_1177" data-name="Group 1177" transform="translate(-599 -948)">
                                    <rect id="Rectangle_660" data-name="Rectangle 660" width="40" height="40" rx="8"
                                        transform="translate(599 948)" fill="transparent" />
                                    <path id="Path_1069" data-name="Path 1069"
                                        d="M51.959,45.23l-.335.122L33.437,51.9a.609.609,0,0,0,.053,1.178L38.2,54.371l.878,2.578.878,2.578a.836.836,0,0,0,1.348.3l2.432-2.3,4.776,3.239a1.02,1.02,0,0,0,1.565-.552l3.163-13.976A.933.933,0,0,0,51.959,45.23Zm-2.322,3.1L41.42,55.049l-.387.317a.418.418,0,0,0-.155.272l-.087.714-.238,2.007a.092.092,0,0,1-.184.015L39.7,56.369l-.69-2.053a.416.416,0,0,1,.2-.492l8.55-4.9L49.371,48C49.6,47.867,49.844,48.163,49.638,48.332Z"
                                        transform="translate(575.992 914.831)" fill="#3881E0" />
                                </g>
                            </svg></a>

                        <a href="#"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 40 40">
                                <g id="Group_1180" data-name="Group 1180" transform="translate(-695 -948)">
                                    <rect id="Rectangle_680" data-name="Rectangle 680" width="40" height="40" rx="8"
                                        transform="translate(695 948)" fill="transparent" />
                                    <path id="Path_1399" data-name="Path 1399"
                                        d="M18.77,119.531q.452-.6.717-.97,1.907-2.624,1.653-3.354l-.066-.114a.638.638,0,0,0-.342-.188,1.685,1.685,0,0,0-.705-.028l-3.174.023a.873.873,0,0,0-.221.005.6.6,0,0,0-.143.034l-.055.028-.044.034a.5.5,0,0,0-.121.12.782.782,0,0,0-.11.2,18.912,18.912,0,0,1-1.179,2.567q-.408.707-.749,1.226a5.829,5.829,0,0,1-.573.764,4.029,4.029,0,0,1-.419.394c-.125.1-.221.141-.286.126s-.125-.029-.187-.046a.744.744,0,0,1-.248-.279,1.287,1.287,0,0,1-.127-.445c-.022-.179-.035-.333-.038-.462s0-.312.006-.548.011-.4.011-.479q0-.433.017-.941t.027-.8q.011-.3.011-.628a2.708,2.708,0,0,0-.039-.519,1.864,1.864,0,0,0-.116-.365.607.607,0,0,0-.226-.274,1.25,1.25,0,0,0-.369-.154,7.1,7.1,0,0,0-1.488-.148,7.017,7.017,0,0,0-2.634.274,1.5,1.5,0,0,0-.419.342q-.2.251-.055.274a1.338,1.338,0,0,1,.937.491l.066.137a2.262,2.262,0,0,1,.154.525,5.5,5.5,0,0,1,.1.833,9.176,9.176,0,0,1,0,1.426q-.055.594-.1.924a1.9,1.9,0,0,1-.149.536,2.266,2.266,0,0,1-.132.251.2.2,0,0,1-.055.057.8.8,0,0,1-.3.057.686.686,0,0,1-.375-.16,2.644,2.644,0,0,1-.457-.439,5.842,5.842,0,0,1-.535-.782q-.3-.5-.617-1.186l-.176-.331q-.165-.319-.452-.93t-.507-1.181a.754.754,0,0,0-.265-.365l-.055-.034a.741.741,0,0,0-.176-.1,1.157,1.157,0,0,0-.254-.074l-3.02.023a.752.752,0,0,0-.628.217l-.044.068a.379.379,0,0,0-.033.183.935.935,0,0,0,.066.308q.661,1.609,1.438,3.1t1.35,2.408q.573.913,1.168,1.723t.788,1.038q.193.229.3.342l.276.274a6.614,6.614,0,0,0,.777.656,13.033,13.033,0,0,0,1.135.753,6.036,6.036,0,0,0,1.449.6,4.832,4.832,0,0,0,1.609.188h1.268a.859.859,0,0,0,.584-.251l.044-.057a.789.789,0,0,0,.083-.211,1.206,1.206,0,0,0,.039-.314,3.882,3.882,0,0,1,.072-.884,2.394,2.394,0,0,1,.187-.594,1.456,1.456,0,0,1,.237-.337.957.957,0,0,1,.187-.165.88.88,0,0,1,.088-.04.683.683,0,0,1,.623.177,3.725,3.725,0,0,1,.672.662q.314.394.755.884a5.226,5.226,0,0,0,.771.73l.221.137a2.66,2.66,0,0,0,.573.251,1.2,1.2,0,0,0,.617.057l2.822-.046a1.24,1.24,0,0,0,.65-.143.558.558,0,0,0,.276-.314.916.916,0,0,0,.006-.388,1.456,1.456,0,0,0-.077-.3,1.571,1.571,0,0,0-.072-.143,11.273,11.273,0,0,0-2.105-2.522l-.022-.023-.011-.012-.011-.011h-.011a12.906,12.906,0,0,1-.893-.936.9.9,0,0,1-.154-.924,8.544,8.544,0,0,1,.991-1.5Z"
                                        transform="translate(704 847.697)" fill="#3881e0" />
                                </g>
                            </svg></a>
                    </div>
                </div>
            </div>
        </div>
        <div class="info--mobile">
                <div class="user__info">
                    <?php if ($_SESSION['user']['avatar']): ?>
                        <div class="avatar"><img src="<?php $_SESSION['user']['avatar'] ?>" alt="avatar"></div>
                    <?php else: ?>
                        <div class="avatar"><img src="img/user_default.svg" alt="avatar"></div>
                    <?php endif; ?>
                    <div class="info__text">
                        <h1>Константин Константинопольски</h1>
                        <h3>На сайте с 02.05.2024</h3>
                    </div>
                </div>
                
                    <div class="contact">
                        <a href="tel: +79002342387" class="phone">+7 900 234-23-87</a>
                        <div class="icon">
                            <a href="#"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40"
                                    viewBox="0 0 40 40">
                                    <g id="Group_1178" data-name="Group 1178" transform="translate(-551 -948)">
                                        <rect id="Rectangle_2" data-name="Rectangle 2" width="40" height="40" rx="8"
                                            transform="translate(551 948)" fill="transparent" />
                                        <g id="Group_684" data-name="Group 684" transform="translate(561.601 958)">
                                            <path id="Path_275" data-name="Path 275"
                                                d="M50.635,36a10.047,10.047,0,0,0-16.1,11.623L33.473,52.8a.383.383,0,0,0,.061.3.388.388,0,0,0,.412.16l5.072-1.2A10.045,10.045,0,0,0,50.635,36ZM49.053,48.625A7.869,7.869,0,0,1,39.991,50.1l-.707-.35-3.11.736.009-.039.644-3.13-.346-.683A7.866,7.866,0,0,1,49.053,37.5a.419.419,0,0,0,.04.041A7.865,7.865,0,0,1,49.053,48.625Z"
                                                transform="translate(-33.447 -33.024)" fill="#3881e0" />
                                            <path id="Path_276" data-name="Path 276"
                                                d="M70.86,69.366a3.267,3.267,0,0,1-1.74,1.517c-1.326.32-3.36.011-5.892-2.349l-.031-.028c-2.226-2.064-2.8-3.782-2.664-5.144a3.256,3.256,0,0,1,1.265-1.93.724.724,0,0,1,1.132.26l.819,1.841a.72.72,0,0,1-.09.736l-.414.538a.713.713,0,0,0-.064.8,7.74,7.74,0,0,0,1.4,1.559,8.2,8.2,0,0,0,1.946,1.394.7.7,0,0,0,.771-.162l.481-.484a.736.736,0,0,1,.718-.184l1.946.552a.736.736,0,0,1,.412,1.088Z"
                                                transform="translate(-55.53 -56.061)" fill="#3881e0" />
                                        </g>
                                    </g>
                                </svg></a>
                            <a href="#"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40"
                                    viewBox="0 0 40 40">
                                    <g id="Group_1177" data-name="Group 1177" transform="translate(-599 -948)">
                                        <rect id="Rectangle_660" data-name="Rectangle 660" width="40" height="40" rx="8"
                                            transform="translate(599 948)" fill="transparent" />
                                        <path id="Path_1069" data-name="Path 1069"
                                            d="M51.959,45.23l-.335.122L33.437,51.9a.609.609,0,0,0,.053,1.178L38.2,54.371l.878,2.578.878,2.578a.836.836,0,0,0,1.348.3l2.432-2.3,4.776,3.239a1.02,1.02,0,0,0,1.565-.552l3.163-13.976A.933.933,0,0,0,51.959,45.23Zm-2.322,3.1L41.42,55.049l-.387.317a.418.418,0,0,0-.155.272l-.087.714-.238,2.007a.092.092,0,0,1-.184.015L39.7,56.369l-.69-2.053a.416.416,0,0,1,.2-.492l8.55-4.9L49.371,48C49.6,47.867,49.844,48.163,49.638,48.332Z"
                                            transform="translate(575.992 914.831)" fill="#3881E0" />
                                    </g>
                                </svg></a>
                            
                            <a href="#"><svg xmlns="http://www.w3.org/2000/svg" width="40" height="40"
                                    viewBox="0 0 40 40">
                                    <g id="Group_1180" data-name="Group 1180" transform="translate(-695 -948)">
                                        <rect id="Rectangle_680" data-name="Rectangle 680" width="40" height="40" rx="8"
                                            transform="translate(695 948)" fill="transparent" />
                                        <path id="Path_1399" data-name="Path 1399"
                                            d="M18.77,119.531q.452-.6.717-.97,1.907-2.624,1.653-3.354l-.066-.114a.638.638,0,0,0-.342-.188,1.685,1.685,0,0,0-.705-.028l-3.174.023a.873.873,0,0,0-.221.005.6.6,0,0,0-.143.034l-.055.028-.044.034a.5.5,0,0,0-.121.12.782.782,0,0,0-.11.2,18.912,18.912,0,0,1-1.179,2.567q-.408.707-.749,1.226a5.829,5.829,0,0,1-.573.764,4.029,4.029,0,0,1-.419.394c-.125.1-.221.141-.286.126s-.125-.029-.187-.046a.744.744,0,0,1-.248-.279,1.287,1.287,0,0,1-.127-.445c-.022-.179-.035-.333-.038-.462s0-.312.006-.548.011-.4.011-.479q0-.433.017-.941t.027-.8q.011-.3.011-.628a2.708,2.708,0,0,0-.039-.519,1.864,1.864,0,0,0-.116-.365.607.607,0,0,0-.226-.274,1.25,1.25,0,0,0-.369-.154,7.1,7.1,0,0,0-1.488-.148,7.017,7.017,0,0,0-2.634.274,1.5,1.5,0,0,0-.419.342q-.2.251-.055.274a1.338,1.338,0,0,1,.937.491l.066.137a2.262,2.262,0,0,1,.154.525,5.5,5.5,0,0,1,.1.833,9.176,9.176,0,0,1,0,1.426q-.055.594-.1.924a1.9,1.9,0,0,1-.149.536,2.266,2.266,0,0,1-.132.251.2.2,0,0,1-.055.057.8.8,0,0,1-.3.057.686.686,0,0,1-.375-.16,2.644,2.644,0,0,1-.457-.439,5.842,5.842,0,0,1-.535-.782q-.3-.5-.617-1.186l-.176-.331q-.165-.319-.452-.93t-.507-1.181a.754.754,0,0,0-.265-.365l-.055-.034a.741.741,0,0,0-.176-.1,1.157,1.157,0,0,0-.254-.074l-3.02.023a.752.752,0,0,0-.628.217l-.044.068a.379.379,0,0,0-.033.183.935.935,0,0,0,.066.308q.661,1.609,1.438,3.1t1.35,2.408q.573.913,1.168,1.723t.788,1.038q.193.229.3.342l.276.274a6.614,6.614,0,0,0,.777.656,13.033,13.033,0,0,0,1.135.753,6.036,6.036,0,0,0,1.449.6,4.832,4.832,0,0,0,1.609.188h1.268a.859.859,0,0,0,.584-.251l.044-.057a.789.789,0,0,0,.083-.211,1.206,1.206,0,0,0,.039-.314,3.882,3.882,0,0,1,.072-.884,2.394,2.394,0,0,1,.187-.594,1.456,1.456,0,0,1,.237-.337.957.957,0,0,1,.187-.165.88.88,0,0,1,.088-.04.683.683,0,0,1,.623.177,3.725,3.725,0,0,1,.672.662q.314.394.755.884a5.226,5.226,0,0,0,.771.73l.221.137a2.66,2.66,0,0,0,.573.251,1.2,1.2,0,0,0,.617.057l2.822-.046a1.24,1.24,0,0,0,.65-.143.558.558,0,0,0,.276-.314.916.916,0,0,0,.006-.388,1.456,1.456,0,0,0-.077-.3,1.571,1.571,0,0,0-.072-.143,11.273,11.273,0,0,0-2.105-2.522l-.022-.023-.011-.012-.011-.011h-.011a12.906,12.906,0,0,1-.893-.936.9.9,0,0,1-.154-.924,8.544,8.544,0,0,1,.991-1.5Z"
                                            transform="translate(704 847.697)" fill="#3881e0" />
                                    </g>
                                </svg></a>
                        </div>
                    </div>
                </div>
        <div class="about">
            <p>Я — опытный инженер-конструктор с 3 годами опыта работы в разработке и проектировании в направлении
                металлообработка и электротехника. Обладаю глубокими знаниями в области машиностроения, технологии
                металлообработки (резка, штамповка, ковка, сварка, термическая обработка и их применение) и навыками
                работы с различными CAD-системами. За свою карьеру я успешно реализовал ряд проектов, среди которых:
                Изготовление откидного болта из кругляка методом холодной штамповки. Разработан технологический процесс
                и изготовлены штампы с учетом сложной формы и шарнирного соединения. Налажено серийное производство
                откидных болтов. Изделия соответствуют всем требованиям заказчика, включая плавную работу шарнира.
                Являюсь целеустремленным, креативным и обладаю отличными аналитическими способностями. Умею работать как
                самостоятельно, так и в команде.<br /><br /> Мои ключевые навыки:<br />Работа с CAD-системами КОМПАС
                3D,<br />
                SolidWorks<br />
                Проведение расчетов и анализ технических решений<br />Подготовка конструкторской
                документации<br />Умение работать
                в команде<br />Отличные коммуникативные навыки<br />Я уверен, что мои знания, опыт и навыки будут ценным
                активом
                для вашей компании или стартапа.

            </p>
        </div>
    </section>
    </nav>
    <?php include 'footer.php' ?>
</body>

</html>